Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::ModifiableElementBase::Modifier Class Reference
MEP Element Manager
Modifier of the ModifiableElementBase. More...
#include <MEPModifiableElementBase.hpp>
 Inheritance diagram for ACAPI::MEP::ModifiableElementBase::Modifier:
 Public Member Functions
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Protected Member Functions
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the ModifiableElementBase.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::ModifiableElementBase::Modifier::Modifier  |  ( |  ModifiableElementBase & |  parent | )
protected
Constructs a Modifier with the parent ModifiableElementBase.
Parameters
parent | The parent ModifiableELementBase.
Member Function Documentation
◆ SetAnchorPoint()
 void ACAPI::MEP::ModifiableElementBase::Modifier::SetAnchorPoint  |  ( |  const API_Coord3D & |  anchorPoint | )
Sets the anchor point of the ModifiableElement.
Parameters
anchorPoint | The value to be set.
◆ SetObjectId()
 void ACAPI::MEP::ModifiableElementBase::Modifier::SetObjectId  |  ( |  const API_Guid & |  libraryPartId | )
Sets the referenced library part of the ModifiableElement.
Parameters
libraryPartId | The main GUID of the library part.
◆ SetOrientation()
 void ACAPI::MEP::ModifiableElementBase::Modifier::SetOrientation  |  ( |  const MEP::Orientation & |  orientation | )
Sets the orientation of the ModifiableElement.
Parameters
orientation | The value to be set, which contains a vector of direction and rotation.